e2e-tests/cypress/fixtures/projectDetails.json

{
  "closeComment": "Task Completed",
  "subIndustry": "Auto Components",
  "projectCategory": "Due Diligence",
  "background": "Lorem ipsum dolor sit amet, consectetur adipiscing elit. Morbi ipsum leo, elementum vel turpis at, ullamcorper aliquet quam. Interdum et malesuada fames ac ante ipsum primis in faucibus. Mauris eget auctor dui. Nunc sit amet justo et tortor fringilla feugiat. Curabitur nisi orci, congue et sapien in, feugiat gravida sem. Sed pretium fringilla eleifend. Curabitur tincidunt et quam eget rhoncus. Curabitur eget tortor hendrerit tortor luctus elementum ac eget arcu. Donec sodales laoreet neque, in finibus arcu dapibus in. Vestibulum pharetra consequat ex sed tempus. In sollicitudin enim a pellentesque condimentum. Vivamus eget risus euismod, consequat dui nec, varius turpis.",
  "blacklistedCompanies": "Vivamus pretium enim egestas elementum ultricies. Curabitur maximus accumsan nisl, non posuere tortor tincidunt eget. Vestibulum dui leo, maximus a augue pharetra, placerat pellentesque sem. In ut lectus nibh. Etiam massa quam, vestibulum a ultricies sit amet, consequat id leo. Fusce non risus dignissim, semper elit sed, tempus purus. Pellentesque.",
  "clientAvailability": "Nam commodo cursus eros, vel facilisis orci egestas elementum. Nulla commodo lorem eros, nec dictum arcu tristique sit amet. Quisque volutpat malesuada mi, at consequat turpis maximus id. Proin nunc purus, sollicitudin nec nibh ac, fermentum aliquam ipsum. Etiam erat nisi, auctor vel leo sed, tempor blandit magna. Fusce ut accumsan mi. Aenean nec vestibulum lorem. Vestibulum scelerisque iaculis turpis ut cursus. Vivamus est felis, iaculis vitae molestie ac, posuere accumsan odio. Nullam efficitur bibendum dolor, sit amet egestas quam elementum ut. Aenean a porta dui, vel porta lacus. Vivamus sodales porttitor arcu, non euismod ante hendrerit eu. Proin sollicitudin.",
  "invoicingInstructions": "Nullam sit amet odio odio. Sed vel turpis ac nisi dictum scelerisque sit amet in mauris. In eros lorem, lobortis a fermentum ut, ultricies non tellus. Quisque hendrerit hendrerit venenatis. Donec nisi ex, luctus quis luctus ut, porta eget justo. Quisque ut est eu tellus mattis rutrum. Fusce in vehicula.",
  "targetNoOfInterviews": "3",
  "segmentTitle": "Heavy Machinary",
  "noOfExperts": "5",
  "requiredResources": "Medium",
  "status": "Open",
  "consultationDescription": "We are working on a project for a client who is looking at $PROJECT. In connection with this, our client is trying to gain a better understanding of ",
  "expertBrief": " Entire details of machinary",
  "screeningQuestion1": "Years of experience do you have",
  "screeningQuestion2": "Fields of expertise",
  "screeningDefaultQuestion": "Please let us know about your relevant experience given the project brief above",
  "expertFollowUpMessage": "Email sent to expert",
  "expertInviteMessageFirstPart": "Expert has been queued to be added the project",
  "expertsInviteMessageFirstPart": "Experts have been queued to be added the project",
  "expertsInviteMessageOnPipeline": "Experts have been invited to the project",
  "expertAddedMessageFirstPart": "Expert has been queued to be added the project",
  "expertsAddedMessageFirstPart": "Experts have been queued to be added the project",
  "eplExportTitle": "Export in progress",
  "eplExportMessage": "Your EPLs export is being processed. Once it's ready",
  "eplLinkModalTitle": "URL for the EPL has been copied to your clipboard",
  "noExpertsFoundTitle": "No suggested experts found",
  "noExpertsFoundMessage": "You need to submit an expert first in order to receive suggestions.",
  "feeAssociatedToInvoiceEditableMessage": "The fee has been associated with an invoice, however, it can still be edited temporarily. Please note that once this invoice has been moved out of a draft status by finance, fees attached to it will no longer be editable.",
  "feeAssociatedToInvoiceMessage": "The fee has been associated with the invoice, hence cannot be edited anymore. Please consult with finance department about further action.",
  "feeAssociatedToENSInvoiceMessage": "This fee has been associated with an ENS invoice.",
  "feeAssociatedToENSCallOnlyInvoiceMessage": "This fee has been associated with an ENS call only invoice.",
  "feeLOPProjectTypeMessage": "This is a LOP project type and free call (e.g. marketing/discount/proposal)",
  "mckinseyDefaultInvoicingEntity": "McKinsey & Company United States",
  "mckinseyChinaInvoiceComment": "Shanghai invoice booked to US per 2021 extension, service provided outside United States",
  "mckinseyNoInvoiceEntityMessage": "This project does not have an Invoicing Entity. No automated invoices will be created for this project.",
  "mckinseyProjectLocationMissingMessage": "Project Location Missing from McKinsey. An email notification has been sent to ENS",
  "mckinseyInvoiceEntityMissingMessage": "Project missing invoice entity. An email notification has been sent to the accounting team",
  "honorariumAmount": "357",
  "honorariumCurrency": "EUR",
  "feeAmountField": "600",
  "feeCreditField": "1",
  "feeCurrency": "EUR",
  "interviewDuration": "60",
  "clietChargeAmount": "200",
  "costAmount": "100",
  "closeProject": {
    "projectStatusId": 3,
    "closingNote": "Sample Comment to close the project",
    "skipFeedback": false,
    "sendRejectionEmails": true,
    "clientContactIds": [
      1038
    ]
  },
  "notificationForExpertAddedtoProject": "Experts have been added to project"
}